chore(content): write-only draft [k8s/cks/part2-cluster-hardening/module-2.5-restricting-api-access]
